<?php

/*
 * ETHER
 * Represents constants and rules for this domain.
 */

define('CIPHER', '');

define('CIPHER_ALL_VARIANTS', ['default', 'elder_futhark', 'younger_futhark', 'anglo_saxon_futhorc']);

define('CIPHER_VARIANT', [
  'default'=> [
    'a' => 'ᚨ', 'b' => 'ᛒ', 'c' => 'ᚲ', 'd' => 'ᛞ',
    'e' => 'ᛖ', 'f' => 'ᚠ', 'g' => 'ᚷ', 'h' => 'ᚺ',
    'i' => 'ᛁ', 'k' => 'ᚴ', 'l' => 'ᛚ', 'm' => 'ᛗ',
    'n' => 'ᚾ', 'o' => 'ᛟ', 'p' => 'ᛈ', 'r' => 'ᚱ',
    's' => 'ᛋ', 't' => 'ᛏ', 'u' => 'ᚢ', 'w' => 'ᚹ',
    'y' => 'ᛇ', 'z' => 'ᛉ'
  ],  
  'elder_futhark' => [
    'a' => 'ᚨ',  'b' => 'ᛒ',  'c' => 'ᚲ',  'd' => 'ᛞ',  'e' => 'ᛖ', 
    'f' => 'ᚠ',  'g' => 'ᚷ',  'h' => 'ᚺ',  'i' => 'ᛁ',  'k' => 'ᚴ', 
    'l' => 'ᛚ',  'm' => 'ᛗ',  'n' => 'ᚾ',  'o' => 'ᛟ',  'p' => 'ᛈ', 
    'r' => 'ᚱ',  's' => 'ᛋ',  't' => 'ᛏ',  'u' => 'ᚢ',  'w' => 'ᚹ', 
    'y' => 'ᛃ',  'z' => 'ᛉ'
  ],
  'younger_futhark' => [
    'a' => 'ᚨ',  'b' => 'ᛒ',  'd' => 'ᛞ',  'e' => 'ᛖ',  'f' => 'ᚠ',
    'g' => 'ᚷ',  'h' => 'ᚺ',  'i' => 'ᛁ',  'k' => 'ᚴ',  'l' => 'ᛚ',
    'm' => 'ᛗ',  'n' => 'ᚾ',  'o' => 'ᛟ',  'r' => 'ᚱ',  's' => 'ᛋ',
    't' => 'ᛏ',  'u' => 'ᚢ',  'y' => 'ᛃ'
  ],
  'anglo_saxon_futhorc' => [
    'a' => 'ᚨ',  'b' => 'ᛒ',  'c' => 'ᚲ',  'd' => 'ᛞ',  'e' => 'ᛖ',
    'f' => 'ᚠ',  'g' => 'ᚷ',  'h' => 'ᚺ',  'i' => 'ᛁ',  'k' => 'ᚲ',
    'l' => 'ᛚ',  'm' => 'ᛗ',  'n' => 'ᚾ',  'o' => 'ᛟ',  'p' => 'ᛈ',
    'r' => 'ᚱ',  's' => 'ᛋ',  't' => 'ᛏ',  'u' => 'ᚢ',  'w' => 'ᚹ',
    'y' => 'ᛃ',  'ð' => 'ᚦ',  'æ' => 'ᚫ',  'ǽ' => 'ᚬ'
  ],
]);